app/controllers/graficos_controller.rb

  def index
  	@atributosdiarios = Atributosdiario.all
    @atributosacumulados = Atributosacumulado.all
    id_segmento = 4 #7 contendrá el valor ponderado


    #@Atributosacumulados = Atributosacumulado.find(Atributosacumulado.where(fecha: Time.parse(Time.now.to_s).strftime("%Y-%m-01")..Time.now).where(segmento: id_segmento).ids)

    version = 1; #DESKTOP
    #se supone que esta y la de más arriba da los ids del mes actual, pero no sé como acceder al valor
    acceso_diario_mes = @atributosdiarios.where("fecha >= ? AND fecha <= ? AND segmento = ? AND pregunta = ? AND version = ?",Time.now.strftime("01/%m/%Y").to_s, Time.now.strftime("%d/%m/%Y").to_s, id_segmento,2,version).order(fecha: :asc).pluck(:valor)
---
SELECT "atributosdiarios"."valor" FROM "atributosdiarios" WHERE (fecha >= '01/12/2016' AND fecha <= '07/12/2016' AND segmento = 4 AND pregunta = 2 AND version = 1) ORDER BY "atributosdiarios"."fecha" ASC