app/controllers/historico_controller.rb

SELECT "indicadoresdiarios".* FROM "indicadoresdiarios" WHERE "indicadoresdiarios"."segmento" = $1 ORDER BY "indicadoresdiarios"."fecha" ASC  [["segmento", 7]]
SELECT "indicadoresacumulados".* FROM "indicadoresacumulados" WHERE "indicadoresacumulados"."segmento" = $1 AND "indicadoresacumulados"."version" = $2 ORDER BY "indicadoresacumulados"."fecha" ASC  [["segmento", 7], ["version", 1]]
---
  def index


  	#ID VERSIONES -- desktop:1    mobile:2     canalOnline:3

  	#PARA DATATABLES
  	@indicadoresdiarios = Indicadoresdiario.where(segmento: 7).order(fecha: :asc)




  	#PARA GRAFICO HISTORICO

  	#DATOS DESKTOP --> version 1
  	version = 1;
  	@nombres_segmentos = ['Global','Contrato','Hibrido','Prepago','Fijo','Pyme Fijo','Pyme Movil'];
  	@datos_desktop_global_acumulado
  	@desktop_global_acumulado = Indicadoresacumulado.where(segmento: 7).where(version: version).order(fecha: :asc)