app/controllers/vista2_controller.rb

SELECT "indicadoresdiarios".* FROM "indicadoresdiarios" WHERE "indicadoresdiarios"."fecha" = $1 AND "indicadoresdiarios"."segmento" = $2 AND "indicadoresdiarios"."version" = $3  [["fecha", "07/12/2016"], ["segmento", 7], ["version", 1]]
---
  def index
    @indicadoresdiarios = Indicadoresdiario.all
    @indicadoresacumulados = Indicadoresacumulado.all
    id_segmento = 7 #7 contendrá el ISN ponderado

    version = 1; #version para valores actuales
    version_global = 3; # version 3 --> guarda datos globales
    #Indicadores Diarios
    if @indicadoresdiarios.where(fecha: Time.now).where(segmento: id_segmento).where(version: version).blank? then