app/controllers/vista2_controller.rb

SELECT "indicadoresdiarios"."fecha" FROM "indicadoresdiarios" WHERE (fecha >= '01/12/2016' AND fecha <= '07/12/2016' AND segmento = 7 AND version = 1) ORDER BY "indicadoresdiarios"."fecha" ASC
SELECT "indicadoresdiarios"."isn" FROM "indicadoresdiarios" WHERE (fecha >= '01/12/2016' AND fecha <= '07/12/2016' AND segmento = 7 AND version = 1) ORDER BY "indicadoresdiarios"."fecha" ASC
SELECT "indicadoresdiarios"."resp_1_2" FROM "indicadoresdiarios" WHERE (fecha >= '01/12/2016' AND fecha <= '07/12/2016' AND segmento = 7 AND version = 1) ORDER BY "indicadoresdiarios"."fecha" ASC
SELECT "indicadoresdiarios"."resp_4_5" FROM "indicadoresdiarios" WHERE (fecha >= '01/12/2016' AND fecha <= '07/12/2016' AND segmento = 7 AND version = 1) ORDER BY "indicadoresdiarios"."fecha" ASC
SELECT "indicadoresdiarios"."resolutividad" FROM "indicadoresdiarios" WHERE (fecha >= '01/12/2016' AND fecha <= '07/12/2016' AND segmento = 7 AND version = 1) ORDER BY "indicadoresdiarios"."fecha" ASC
SELECT "indicadoresacumulados"."fecha" FROM "indicadoresacumulados" WHERE (fecha >= '01/12/2016' AND fecha <= '07/12/2016' AND segmento = 7 AND version = 1) ORDER BY "indicadoresacumulados"."fecha" ASC
SELECT "indicadoresacumulados"."resolutividad" FROM "indicadoresacumulados" WHERE (fecha >= '01/12/2016' AND fecha <= '07/12/2016' AND segmento = 7 AND version = 1) ORDER BY "indicadoresacumulados"."fecha" ASC
---
  def index
    @indicadoresdiarios = Indicadoresdiario.all
    @indicadoresacumulados = Indicadoresacumulado.all
    id_segmento = 7 #7 contendrá el ISN ponderado

    #Indicadores Diarios
    if @indicadoresdiarios.where(fecha: Time.now).where(segmento: id_segmento).blank? then
      @isn_diario = 0
      @resp_1_2_diario = 0
      @resp_4_5_diario = 0
      @resolu_diario = 0
    else
      @isn_diario = @indicadoresdiarios.where(fecha: Time.now).where(segmento: id_segmento).take.isn
      @resp_1_2_diario = @indicadoresdiarios.where(fecha: Time.now).where(segmento: id_segmento).take.resp_1_2
      @resp_4_5_diario = @indicadoresdiarios.where(fecha: Time.now).where(segmento: id_segmento).take.resp_4_5
      @resolu_diario = @indicadoresdiarios.where(fecha: Time.now).where(segmento: id_segmento).take.resolutividad
    end
    #@indicadoresdiarios = Indicadoresdiario.find(Indicadoresdiario.where(fecha: Time.parse(Time.now.to_s).strftime("%Y-%m-01")..Time.now).where(segmento: id_segmento).ids).isn

    #Indicadores Acumulados
    if @indicadoresacumulados.where(fecha: Time.now).where(segmento: id_segmento).blank? then
      @isn_acumulado = 0
      @resp_1_2_acumulado = 0
      @resp_4_5_acumulado = 0
      @resolu_acumulado = 0
    else
      @isn_acumulado = @indicadoresacumulados.where(fecha: Time.now).where(segmento: id_segmento).take.isn